CREATE DATABASE final CHARACTER SET utf8 COLLATE utf8_general_ci;

CREATE TABLE Сотрудники(
    id INT PRIMARY KEY AUTO_INCREMENT,
    ФИО VARCHAR(100)
);

INSERT INTO Сотрудники (ФИО)
VALUES ('Тетерин Архип Святославович'),
('Рябов Феликс Артёмович'),
('Михайлов Роберт Евсеевич'),
('Пономарёв Май Георгиевич'),
('Мамонтов Рудольф Семенович'),
('Миронов Эрик Альбертович'),
('Киселёв Леонард Лукьевич'),
('Голубев Петр Русланович'),
('Колесников Максимилиан Борисович'),
('Коновалов Влас Геласьевич'),
('Морозов Зиновий Демьянович'),
('Шарапов Павел Глебович'),
('Шилов Остап Тимурович');

CREATE TABLE Должности(
    id INT PRIMARY KEY AUTO_INCREMENT,
    Должность VARCHAR(100),
    Сотрудник_id INT,
    Руководитель_id INT,
    FOREIGN KEY (Сотрудник_id) REFERENCES Сотрудники(id)
);

INSERT INTO Должности (Должность, Сотрудник_id, Руководитель_id)
VALUES ('Директор', 4, null),
('Ком директор', 3, 1),
('Тех директор', 2, 1),
('Начальник отдела кадров', 1, 1),
('Директор по ИТ', 7, 1),
('Руководитель 1', 6, 4),
('Руководитель 2', 5, 4),
('Руководитель 3', 8, 2),
('Руководитель 4', 11, 3),
('Сотрудник 1', 10, 3),
('Сотрудник 2', 9, 6),
('Сотрудник 3', 12, 7),
('Сотрудник 4', 13, 5);



/* Запросы */

-- ФИО всех сотрудников, их должности и руководители --
SELECT DISTINCT Сотрудники.ФИО, Должности.Должность, Рук1.ФИО
FROM Должности, Сотрудники,
    (SELECT Сотрудники.ФИО, Должности.Должность, Должности.id, Должности.Сотрудник_id, Должности.Руководитель_id
    FROM Сотрудники, Должности, 
        (SELECT Должности.Руководитель_id
        FROM Должности) AS Рук
    WHERE Должности.id = Рук.Руководитель_id AND Сотрудники.id = Должности.Сотрудник_id
    ) AS Рук1
WHERE Сотрудники.id = Должности.Сотрудник_id AND Рук1.id = Должности.Руководитель_id;

-- ФИО руководителей и кол-во подчиненных --
SELECT DISTINCT Сотрудники.ФИО, Должности.Должность, Рук.counted AS "Кол-во подчиненных"
FROM Сотрудники, Должности, 
    (SELECT Должности.Руководитель_id, COUNT(Должности.Руководитель_id) AS counted
    FROM Должности
    GROUP BY (Должности.Руководитель_id)) AS Рук
WHERE Должности.id = Рук.Руководитель_id AND Сотрудники.id = Должности.Сотрудник_id;
